/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: GUI_XINPUT.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2014 年 09 月 23 日
**
** 描        述: emWin 与 xinput 模块对接层
*********************************************************************************************************/
#ifndef GUI_XINPUT_H_
#define GUI_XINPUT_H_

#include "DIALOG.h"

typedef struct {
    long long     x, y;
} GUI_XPOINT;

enum GUI_XINPUT_Location {
    GUI_XINPUT_TopLeft = 0,
    GUI_XINPUT_BottomLeft = 1,
    GUI_XINPUT_BottomRight = 2,
    GUI_XINPUT_TopRight = 3,
    GUI_XINPUT_Center = 4,
    GUI_XINPUT_LastLocation = GUI_XINPUT_Center
};

typedef struct {
    GUI_XPOINT  devPoints[5];
    GUI_XPOINT  screenPoints[5];
} GUI_XINPUT_PointerCalibrationData;
/*********************************************************************************************************
** 函数名称: GUI_XPOINT_Create
** 功能描述: 生成 GUI_XPOINT
** 输　入  : x             x 坐标
**           y             y 坐标
** 输　出  : GUI_XPOINT
** 全局变量:
** 调用模块:
*********************************************************************************************************/
GUI_XPOINT  GUI_XPOINT_Create(long long  x, long long  y);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_Init
** 功能描述: GUI 初始化 XINPUT
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_Init(void);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_HandleEvent
** 功能描述: GUI XINPUT 处理事件
** 输　入  : uiMs          延时多少 ms
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
void  GUI_XINPUT_HandleEvent(U32  uiMs);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_SetFilterSize
** 功能描述: 设置 Filter 大小
** 输　入  : iSize         Filter 大小
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_SetFilterSize(int  iSize);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_SetCalibrateWin
** 功能描述: 设置 Calibrate 窗口
** 输　入  : hWin              Calibrate 窗口
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_SetCalibrateWin(WM_HWIN  hWin);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_SetCalibrateData
** 功能描述: 设置校正数据
** 输　入  : pData         校正数据
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_SetCalibrateData(const GUI_XINPUT_PointerCalibrationData  *pData);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_GetCalibrateData
** 功能描述: 获得校正数据
** 输　入  : pData         校正数据
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_GetCalibrateData(GUI_XINPUT_PointerCalibrationData  *pData);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_DelCalibrateFile
** 功能描述: 删除校正文件并清除校正信息
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
void  GUI_XINPUT_DelCalibrateFile(void);
/*********************************************************************************************************
** 函数名称: GUI_XINPUT_IsCalibrated
** 功能描述: 判断是否屏幕被校正过
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
                                           API 函数
*********************************************************************************************************/
int  GUI_XINPUT_IsCalibrated(void);

#endif                                                                  /*  GUI_XINPUT_H_               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
